[
  {"id":"alexanderssonAnalysisRollDamping2021","abstract":"Having an accurate prediction of ship roll damping is crucial when analysing roll motions. In this paper, the simplified Ikeda method (SI-method) is compared with the original Ikeda method. The methods are compared using results from a database of roll decay tests carried out on modern merchant ships and a smaller set of predictions in which the original Ikeda method was used. It was found that most of the ships in the database had dimensions outside the limits of the SI-method. Thus, the SI-method showed poor agreement with model tests outside its limits but acceptable agreement for ships within limits. It was found that the deviations were caused by extrapolation errors of the wave-damping in the SI-method. Two ways to improve the accuracy of the SI-method were proposed based on regression, which gave about the same accuracy as the original Ikeda method.","accessed":{"date-parts":[["2021",4,14]]},"author":[{"family":"Alexandersson","given":"Martin"},{"family":"Mao","given":"Wengang"},{"family":"Ringsberg","given":"Jonas W."}],"citation-key":"alexanderssonAnalysisRollDamping2021","container-title":"Ships and Offshore Structures","DOI":"10.1080/17445302.2021.1907070","ISSN":"1744-5302","issue":"0","issued":{"date-parts":[["2021",4,13]]},"page":"1-8","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Analysis of roll damping model scale data","type":"article-journal","URL":"https://www.tandfonline.com/doi/abs/10.1080/17445302.2021.1907070","volume":"0"},
  {"id":"alexanderssonCodePaperSystem2022","abstract":"No description provided.","accessed":{"date-parts":[["2022",10,11]]},"author":[{"family":"Alexandersson","given":"Martin"}],"citation-key":"alexanderssonCodePaperSystem2022","DOI":"10.5281/zenodo.7153282","issued":{"date-parts":[["2022",10,6]]},"publisher":"Zenodo","source":"Zenodo","title":"Code for paper System identification of Vessel Manoeuvring Models","title-short":"martinlarsalbert/System-identification-of-Vessel-Manoeuvring-Models","type":"software","URL":"https://zenodo.org/record/7153282"},
  {"id":"alexanderssonComparisonShipManoeuvrability2022","abstract":"It is essential to describe a ship’s manoeuvrability for various applications, e.g. optimal control of unmanned surface vehicles (USVs). In this study, the capability of two recognised manoeuvrability models to predict ships’ trajectories is investigated based on both simulation and open-water experiment test data. The parameters of these models are estimated by a statistical learning method. The goodness of the two estimated models for describing a merchant ship’s manoeuvrability is first studied using her manoeuvring simulation data. Then, experimental manoeuvring tests to use a USV in open water with wind and drifting effects are used to check the conventional model identification procedures. Finally, some modifications and adjustments are proposed to improve the conventional procedures. It shows that the proposed procedures can accurately derive the ship’s manoeuvrability based on experimental data.","accessed":{"date-parts":[["2022",11,10]]},"author":[{"family":"Alexandersson","given":"Martin"},{"family":"Zhang","given":"Daiyong"},{"family":"Mao","given":"Wengang"},{"family":"Ringsberg","given":"Jonas W."}],"citation-key":"alexanderssonComparisonShipManoeuvrability2022","container-title":"Ships and Offshore Structures","DOI":"10.1080/17445302.2022.2067409","ISSN":"1744-5302","issue":"0","issued":{"date-parts":[["2022",5,1]]},"page":"1-8","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"A comparison of ship manoeuvrability models to approximate ship navigation trajectories","type":"article-journal","URL":"https://doi.org/10.1080/17445302.2022.2067409","volume":"0"},
  {"id":"alexanderssonIkedaTwodimensionalCylinders2021","abstract":"This data has been collected with manual digitalization from the following paper: [1] Ikeda, Y., 1978. On eddy making component of roll damping force on naked hull. University of Osaka Prefacture, Department of Naval Architecture, Japan, Report No. 00403, Published in: Journal of Society of Naval Architects of Japan, Volume 142. The data can be used to predict ship eddy damping. Nomenclature: row number: same as in Table 1 [1] phi_a : roll amplitude [rad] B_star_hat omega_hat model : section model name B_W+B_F : Obtained value from plots B_E_star_hat L_pp : length of section [m] beam : section beam [m] T : section draught [m] Disp : section displacement [m^3] H0 : half beam to draught ratio sigma : section area coefficient OG/d : centre of rotation R : bilge radius [m] B_E0_HAT : eddy damping C_r : eddy damping coefficient a_1 : lewis section coefficient a_3 : lewis section coefficient","accessed":{"date-parts":[["2021",2,22]]},"author":[{"family":"Alexandersson","given":"Martin"}],"citation-key":"alexanderssonIkedaTwodimensionalCylinders2021","DOI":"10.17632/P3R9NMTVYJ.1","issued":{"date-parts":[["2021",2,22]]},"license":", Creative Commons Attribution 4.0 International","publisher":"Mendeley","source":"DOI.org (Datacite)","title":"Ikeda two-dimensional cylinders","type":"dataset","URL":"https://data.mendeley.com/datasets/p3r9nmtvyj/1"},
  {"id":"alexanderssonKVLCC2RollDecay2021","abstract":"Roll decay tests for KVLCC2 Simulations with Fully non-linear potential flow (FNPF): fnpf_parameters.csv : contains meta data about the simulations. fnpf_kvlcc2_rolldecay_0kn.csv : invicid simulation at 0 knots fnpf_kvlcc2_rolldecay_15-5kn_const_large2.csv : invicid simualtion at 15.5 knots Hybrid method: fnpf_kvlcc2_rolldecay_15-5kn_ikeda_dev.csv : hybrid simulation at 15.5 knots Model tests: model_test_parameters.csv : meta data about the model tests model_test_units.csv : units in files Time series corresponding to the meta data. model_test_21337.csv model_test_21338.csv model_test_21340.csv","accessed":{"date-parts":[["2021",2,22]]},"author":[{"family":"Alexandersson","given":"Martin"},{"family":"Kjellberg","given":"Martin"}],"citation-key":"alexanderssonKVLCC2RollDecay2021","DOI":"10.17632/2stvkyngj9.1","issued":{"date-parts":[["2021",2,22]]},"language":"en","publisher":"Mendeley","source":"data.mendeley.com","title":"KVLCC2 roll decay","type":"dataset","URL":"https://data.mendeley.com/datasets/2stvkyngj9/1"},
  {"id":"alexanderssonMartinlarsalbertRolldecayestimators2020","abstract":"scikit-learn-compatible estimators of roll decay tests","accessed":{"date-parts":[["2020",5,26]]},"author":[{"family":"Alexandersson","given":"Martin"}],"citation-key":"alexanderssonMartinlarsalbertRolldecayestimators2020","genre":"Python","issued":{"date-parts":[["2020",5,20]]},"license":"BSD-3-Clause","original-date":{"date-parts":[["2020",1,31]]},"source":"GitHub","title":"martinlarsalbert/rolldecay-estimators","type":"software","URL":"https://github.com/martinlarsalbert/rolldecay-estimators"},
  {"id":"alexanderssonPredictionRollMotion2021","abstract":"Getting the best possible accuracy with the lowest possible computational cost is an important factor in the early design stage of ships. Potential flow-based analysis presents such a solution for seakeeping analyses. The accuracy of roll motion in potential flow is however not so good, due to the large influence from vicsous roll damping, which is missing in these calculations. This paper proposes a hybrid method, as a solution to this problem , where the viscous roll damping from Ikeda's semi-empirical method is injected into an existing 3D unsteady fully nonlinear potential flow (FNPF) method. The hybrid method is investigated using roll decay tests with the KVLCC2 test case. This investigation shows that the accuracy of simulated roll motions is significantly improved and also shows good agreement with the corresponding roll decay model tests.","author":[{"family":"Alexandersson","given":"Martin"},{"family":"Kjellberg","given":"Martin"},{"family":"Mao","given":"Wengang"},{"family":"Ringsberg","given":"Jonas W"}],"citation-key":"alexanderssonPredictionRollMotion2021","container-title":"Proceedings of the Thirty-first (2021) International Ocean and Polar Engineering Conference","event-place":"Rhodes, Greece","event-title":"International Ocean and Polar Engineering Conference","ISBN":"978-1-880653-82-1","issued":{"date-parts":[["2021",6,21]]},"license":"All rights reserved","publisher":"International Society of Offshore and Polar Engineers (ISOPE)","publisher-place":"Rhodes, Greece","source":"ResearchGate","title":"Prediction of roll motion using fully nonlinear potential flow and Ikeda's method","type":"paper-conference"},
  {"id":"alexanderssonRolldecayestimators2022","abstract":"Code developed for paper: Analysis of roll damping model scale data (https://doi.org/10.1080/17445302.2021.1907070)","accessed":{"date-parts":[["2022",11,7]]},"author":[{"family":"Alexandersson","given":"Martin"}],"citation-key":"alexanderssonRolldecayestimators2022","DOI":"10.5281/ZENODO.7299345","issued":{"date-parts":[["2022",11,7]]},"license":"MIT License, Open Access","publisher":"Zenodo","source":"DOI.org (Datacite)","title":"rolldecay-estimators","type":"software","URL":"https://zenodo.org/record/7299345","version":"v0.7.0"},
  {"id":"alexanderssonSTUDYMETHODSPREDICT2009","abstract":"This thesis is an overview of added resistance in waves, available methods and how a simplified method\ncan be developed.\nAdded resistance in waves is indeed a very complicated problem. The present methods, most of them\ndeveloped during the 1970s, give reasonable results for head waves. But for quartering and following\nwaves, the methods have low accuracy, due to uncertainties in strip calculated ship motions for these\ncases, and the ability to account for roll and yaw motions.\nIn this thesis Gerristma and Beukelman’s method and Boese’s method to calculate added resistance is\nimplemented and validated against published calculation results, from previous implementations. The\nimplementations are also evaluated against published experimental results in head waves. These\nevaluations show that added resistance with good accuracy can be calculated for head waves using\nGerritsma and Beukelman’s method.\nThis thesis also shows how a simplified method to calculate added resistance in waves can be developed.\nThis simplified method only uses the ships main particulars to describe the hull. The method is intended\nto be used when the entire hull geometry is not available, for instance in the pre-study of a new ship\ndesign. The idea with this method is to estimate transfer functions for added resistance without using strip\ncalculations. The transfer functions are parameterized with three parameters, peak value, peak frequency\nand spreading. Expressions for these parameters are derived with regression analysis, based on analytical\nresults from Gerritsma and Beukelman’s method. The simplified method has an accuracy of about 25%,\nwhich is about the same amount that usually can be expected of a method to calculate added resistance in\nwaves.","author":[{"family":"Alexandersson","given":"Martin"}],"citation-key":"alexanderssonSTUDYMETHODSPREDICT2009","DOI":"10.13140/RG.2.2.18796.69767","issued":{"date-parts":[["2009",1,1]]},"source":"ResearchGate","title":"A STUDY OF METHODS TO PREDICT ADDED RESISTANCE IN WAVES","type":"thesis"},
  {"id":"alexanderssonSystemIdentificationPhysics2024","abstract":"System identification offers ways to obtain proper models describing a ship’s dynamics in real operational conditions, but also poses some major challenges, such as multicollinearity and generality of the identified model.","author":[{"family":"Alexandersson","given":"Martin"},{"family":"Mao","given":"Wengang"},{"family":"Ringsberg","given":"Jonas W"},{"family":"Kjellberg","given":"Martin"}],"citation-key":"alexanderssonSystemIdentificationPhysics2024","issued":{"date-parts":[["2024",4,1]]},"language":"en","source":"Zotero","title":"System identification of a physics informed ship model for better predictions in wind conditions","type":"article-journal"},
  {"id":"alexanderssonSystemIdentificationVessel2022","abstract":"Identifying the ship’s maneuvering dynamics can build models for ship maneuverability predictions with a wide range of useful applications. A majority of the publications in this field are based on simulated data. In this paper model test data is used. The identification process can be decomposed into finding a suitable manoeuvring model for the hydrodynamic forces and to correctly handle errors from the measurement noise. A parameter estimation is proposed to identify the hydrodynamic derivatives. The most suitable manoeuvring model is found using the parameter estimation with cross-validation on a set of competing manoeuvring models. The parameter estimation uses inverse dynamics regression and Extended Kalman filter (EKF) with a Rauch Tung Striebel (RTS) smoother. Two case study vessels, wPCC and KVLCC2, with very different maneuverability characteristics are used to demonstrate and validate the proposed method. Turning circle predictions with the robust manoeuvring models, trained on zigzag model tests, show good agreement with the corresponding model test results for both ships.","accessed":{"date-parts":[["2022",11,14]]},"author":[{"family":"Alexandersson","given":"Martin"},{"family":"Mao","given":"Wengang"},{"family":"Ringsberg","given":"Jonas W."}],"citation-key":"alexanderssonSystemIdentificationVessel2022","container-title":"Ocean Engineering","container-title-short":"Ocean Engineering","DOI":"10.1016/j.oceaneng.2022.112940","ISSN":"0029-8018","issued":{"date-parts":[["2022",12,15]]},"language":"en","page":"112940","source":"ScienceDirect","title":"System identification of Vessel Manoeuvring Models","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0029801822022235","volume":"266"},
  {"id":"alexanderssonTHESISDEGREELICENTIATE2022","abstract":"It is common today that operational data is recorded onboard ships within the Internet\nof Ships (IoS) paradigm. This enables the possibility to build ship digital twins as\ndigital copies of the real ships. Predicting the ship’s motions with ship dynamics could\nbe an important sub-component of these ship digital twins. A model for the ship’s\ndynamics can be identified based on observations of the ship’s motions. The identified\nmodel will have model uncertainty due to imperfections and idealizations made in\nphysical model formulations as well as uncertainty from errors in the measurement\ndata, which can be very pronounced when using full scale operational data. It is\neasier to develop accurate models with low model uncertainty using data obtained in\na controlled laboratory environment where the measurement errors are much lower,\nespecially in calm water conditions. The prediction model should be able to describe\nscenarios that a ship has never encountered before, which is possible if much of the\nunderlying physics has been identified. Grey-box modelling is a technique which\ncombines operational data with physical principles to achieve this.\nThe objective of this thesis is to develop system identification methods for grey\nbox models with good generalization of the model scale rigid body ship dynamics in\ncalm waters.\nA model development procedure is proposed to handle the model uncertainty\nthrough the selection of candidate models based on a hold-out evaluation procedure.\nThe measurement noise is handled by an iterative preprocessor, which uses an extended\nKalman filter (EKF) and a Rauch Tung Striebel (RTS) smoother that uses an initially\nestimated predictor model from semi-empirical formulas.\nIt is demonstrated that the ship’s roll motion with high accuracy can be described\nusing a quadratic damping model. For the more complex manoeuvring models,\nmulticollinearity is a large problem where the appropriate complexity needs to be\nselected with the bias-variance trade-off between underfitting or overfitting the data.\nHold-out turning circle tests were predicted with high accuracy for the wPCC and\nKVLCC2 test case ships with models from the proposed development procedure and\nparameter estimation method.\nThe proposed methods can produce prediction models with high generalization\ngiven that a suitable model structure has been selected from the candidate models\nand an appropriate split in the hold-out evaluation of the model development process\nhas been applied.","author":[{"family":"Alexandersson","given":"Martin"}],"citation-key":"alexanderssonTHESISDEGREELICENTIATE2022","DOI":"10.13140/RG.2.2.23950.02889","issued":{"date-parts":[["2022",12,1]]},"source":"ResearchGate","title":"THESIS FOR THE DEGREE OF LICENTIATE OF ENGINEERING Rigid Body Ship Dynamics System Identification in Calm Waters","type":"thesis"},
  {"id":"alexanderssonVirtualCaptiveTests2017","author":[{"family":"Alexandersson","given":"Martin"},{"family":"Korkmaz","given":"Kadir"},{"family":"Mazza","given":"Gabriele"}],"citation-key":"alexanderssonVirtualCaptiveTests2017","issued":{"date-parts":[["2017",10,2]]},"source":"ResearchGate","title":"Virtual Captive Tests with a destroyer hull form","type":"paper-conference"},
  {"id":"alexanderssonWPCCManoeuvringModel2024","abstract":"Model test data from research project at SSPA Maritime Dynamics Laboratory. Used in paper: System identification of a physics informed ship model for better predictions in wind conditions. The major change compared to previous versions of this dataset is that the motions are now expressed in [lpp/2,0,WL], instead of CG (as before).","accessed":{"date-parts":[["2024",2,19]]},"author":[{"family":"Alexandersson","given":"Martin"}],"citation-key":"alexanderssonWPCCManoeuvringModel2024","DOI":"10.17632/j5zdrhr9bf.3","issued":{"date-parts":[["2024",2,19]]},"language":"en","publisher":"Mendeley Data","source":"data.mendeley.com","title":"wPCC manoeuvring model tests","type":"dataset","URL":"https://data.mendeley.com/datasets/j5zdrhr9bf/3"},
  {"id":"kawaharaSimplePredictionFormula2011a","abstract":"Since the roll damping of ships has significant effects of viscosity, it is difficult to calculate it theoretically. Therefore experimental results or some prediction methods are used to get the roll damping in design stage of ships. Among some prediction methods, Ikeda’s one is widely used in many ship motion computer programs.","accessed":{"date-parts":[["2020",1,30]]},"author":[{"family":"Kawahara","given":"Yuki"},{"family":"Maekawa","given":"Kazuya"},{"family":"Ikeda","given":"Yoshiho"}],"citation-key":"kawaharaSimplePredictionFormula2011a","container-title":"Contemporary Ideas on Ship Stability and Capsizing in Waves","DOI":"10.1007/978-94-007-1482-3_26","editor":[{"family":"Almeida Santos Neves","given":"Marcelo"},{"family":"Belenky","given":"Vadim L."},{"family":"Kat","given":"Jean Otto","non-dropping-particle":"de"},{"family":"Spyrou","given":"Kostas"},{"family":"Umeda","given":"Naoya"}],"event-place":"Dordrecht","ISBN":"978-94-007-1481-6 978-94-007-1482-3","issued":{"date-parts":[["2011"]]},"language":"en","page":"465-486","publisher":"Springer Netherlands","publisher-place":"Dordrecht","source":"DOI.org (Crossref)","title":"A Simple Prediction Formula of Roll Damping of Conventional Cargo Ships on the Basis of Ikeda’s Method and Its Limitation","type":"chapter","URL":"http://link.springer.com/10.1007/978-94-007-1482-3_26","volume":"97"},
  {"id":"marimongiovannettiEffectsHydrodynamicForces2020","abstract":"Assessing the manoeuvring performances of a ship at a design stage is becoming more important, especially when trying to improve shipping efficiency to reduce fuel consumption.\nWhen designing a hull with appendages, it is necessary to balance hydrodynamic efficiency with manoeuvrability. Therefore, the possibility of simulating a captive test at a design stage will increase the chances of understanding the behaviour of a ship from an early stage in the design process. The current research is based on the evaluation of hydrodynamic efficiency of a hull and appendages in a pure resistance, self-propulsion and in a wind-assisted mode.\nThe forces and moments acting on the hull and appendages are then analysed and used as inputs for a Virtual Captive Test (VCT) [1]. In order to correctly perform a VCT and further analyse the performances of a ship with a Velocity Prediction Programme (VPP), particular care has been put in correctly capturing the manoeuvrability coefficients. Those are derived with polynomial fittings once the forces and moments acting on the ship are extracted from the Computational Fluid Dynamics (CFD) simulations.\nMany CFD simulations were performed to assess the hydrodynamic characteristics of the hull and appendages in a range of flow directions, rudder angles and rotating flow. Those simulations encompass the whole range of datapoints needed to describe a wind-assisted ship during manoeuvring.\nTaking into consideration both hydrodynamic characteristics and manoeuvrability effects at an early design stage can reduce model tests costs and will allow to inspect a larger number of hull-appendages scenarios when analysing the final VPP results.","author":[{"family":"Marimon Giovannetti","given":"Laura"},{"family":"Olsson","given":"Fredrik"},{"family":"Alexandersson","given":"Martin"},{"family":"Werner","given":"Sofia"},{"family":"Finnsgård","given":"Christian"}],"citation-key":"marimongiovannettiEffectsHydrodynamicForces2020","DOI":"10.1115/OMAE2020-18673","issued":{"date-parts":[["2020",8,3]]},"source":"ResearchGate","title":"The Effects of Hydrodynamic Forces on Maneuvrability Coefficients for Wind-Assisted Ships","type":"book"}
]
